In [1]:
import sqlalchemy as sqa
import pandas as pd

In [2]:
container = "metadata_db"
port = "5432"
user = "pguser"
password = "pgpassword"
db_class = "postgresql"
db = "playground_db"

In [3]:
con_str = f"{db_class}://{user}:{password}@{container}:{port}/postgres"
db_str = f"{db_class}://{user}:{password}@{container}:{port}/{db}"

In [4]:
con_str

'postgresql://pguser:pgpassword@metadata_db:5432/postgres'

In [11]:
def create_db_if_not_exists(db: str, con_str: str) -> None:
    with sqa.create_engine(con_str).connect() as con:
        db_query = "SELECT datname FROM pg_catalog.pg_database"
        dbs = set(db_val[0] for db_val in con.execute(db_query).fetchall())
        if db in dbs:
            print(f"Database {db} already exists")
        else:
            con.execute("commit")
            con.execute(f"CREATE DATABASE {db}")
            
create_db_if_not_exists(db, con_str)

Database playground_db already exists

In [12]:
engine = sqa.create_engine(db_str)

postgres://pguser@postgres:5432/pg

In [13]:
sample_data = pd.DataFrame([
    {'a': 1, 'b': 'X'},
    {'a': 2, 'b': 'Y'},
    {'a': 4, 'b': 'Z'}
])
sample_data.head()

   a  b
0  1  X
1  2  Y
2  4  Z

In [14]:
with engine.connect() as con:
    sample_data.to_sql('test', con, method='multi', if_exists='replace')

In [15]:
with engine.connect() as con:
    test_data = pd.read_sql('test', con)
    
    
test_data.head()

   index  a  b
0      0  1  X
1      1  2  Y
2      2  4  Z

In [17]:
metadata_db = "metadata"
metadata_tbl = "base_images"

metadata_eng = sqa.create_engine(f"{db_class}://{user}:{password}@{container}:{port}/{metadata_db}")

with metadata_eng.connect() as con:
    test = pd.read_sql(metadata_tbl, con)
    
test.head()

,file_name,download_loc,final_loc,full_path,search_term,source,read,orig_width,orig_height,width,height,label,label_str,download_name
0,poison_ivy_plant_1095.jpg,simple_images/poison ivy plant/poison ivy plan...,../datasets/pipeline_v1/downloaded_images/posi...,/home/code/datasets/pipeline_v1/downloaded_ima...,poison ivy plant,Google Images,True,1024.0,575.0,890.0,500.0,1.0,positive,None
1,poison_ivy_plant_1556.jpg,simple_images/poison ivy plant/poison ivy plan...,../datasets/pipeline_v1/downloaded_images/posi...,/home/code/datasets/pipeline_v1/downloaded_ima...,poison ivy plant,Google Images,True,750.0,500.0,750.0,500.0,1.0,positive,None
2,poison_ivy_plant_1294.jpg,simple_images/poison ivy plant/poison ivy plan...,../datasets/pipeline_v1/downloaded_images/posi...,/home/code/datasets/pipeline_v1/downloaded_ima...,poison ivy plant,Google Images,True,1800.0,1013.0,888.0,500.0,1.0,positive,None
3,poison_ivy_plant_964.jpg,simple_images/poison ivy plant/poison ivy plan...,../datasets/pipeline_v1/downloaded_images/posi...,/home/code/datasets/pipeline_v1/downloaded_ima...,poison ivy plant,Google Images,True,480.0,310.0,480.0,310.0,1.0,positive,None
4,poison_ivy_plant_1526.jpg,simple_images/poison ivy plant/poison ivy plan...,../datasets/pipeline_v1/downloaded_images/posi...,/home/code/datasets/pipeline_v1/downloaded_ima...,poison ivy plant,Google Images,True,1600.0,1031.0,775.0,500.0,1.0,positive,None

## Example with foreign key

In [39]:
customers = pd.DataFrame([
    ("cust001", "John", "NJ"),
    ("cust002", "Jane", "NJ"),
    ("cust003", "Doe", "NY"),
    ("cust004", "Ray", "NJ"),
    ("cust005", "Mi", "NY"),
], columns=["cust_id", "name", "location"]).set_index("cust_id")

orders = pd.DataFrame([
    ("ord001", "cust005", "books", 1),
    ("ord002", "cust001", "books", 4),
    ("ord003", "cust002", "magazines", 6),
    ("ord004", "cust003", "books", 5),
    ("ord005", "cust005", "books", 5),
    ("ord006", "cust004", "magazines", 3),
    ("ord007", "cust005", "comic", 2),
    ("ord008", "cust001", "comic", 1),
    ("ord009", "cust002", "books", 5),
], columns=["ord_id", "cust_id", "item", "amount"]).set_index("ord_id")

In [19]:
customers

         name location
cust_id
cust001  John       NJ
cust002  Jane       NJ
cust003   Doe       NY
cust004   Ray       NJ
cust005    Mi       NY

In [20]:
orders

        cust_id       item  amount
ord_id
ord001  cust005      books       1
ord002  cust001      books       4
ord003  cust002  magazines       6
ord004  cust003      books       5
ord005  cust005      books       5
ord006  cust004  magazines       3
ord007  cust005      comic       2
ord008  cust001      comic       1
ord009  cust002      books       5

In [24]:
def get_primary_key_query(tbl):
    query = f"""SELECT c.column_name, c.data_type
                FROM information_schema.table_constraints tc 
                JOIN information_schema.constraint_column_usage AS ccu USING (constraint_schema, constraint_name) 
                JOIN information_schema.columns AS c ON c.table_schema = tc.constraint_schema
                AND tc.table_name = c.table_name AND ccu.column_name = c.column_name
                WHERE constraint_type = 'PRIMARY KEY' and tc.table_name = '{tbl}';
                """
    return(query)

In [51]:
create_customers_statement = """
CREATE TABLE customers (
    cust_id TEXT UNIQUE NOT NULL,
    name TEXT,
    location TEXT,
    PRIMARY KEY(cust_id)
)
"""

create_orders_statement = """
CREATE TABLE orders (
    ord_id TEXT UNIQUE NOT NULL,
    cust_id TEXT NOT NULL,
    item TEXT,
    amount INT,
    PRIMARY KEY(ord_id),
    FOREIGN KEY(cust_id) REFERENCES customers(cust_id)
)
"""

with engine.connect() as con:
    try:
        con.execute("DROP TABLE orders")
        con.execute("DROP TABLE customers")
    except:
        pass
    con.execute(create_customers_statement)
    con.execute(create_orders_statement)
    
    
    customers.to_sql("customers", con, if_exists="append")
    orders.to_sql("orders", con, if_exists="append")
    # orders.to_sql("orders", con, index=True, if_exists="append")
    
    
    
    test = con.execute(get_primary_key_query("customers"))
    print(test.fetchall())
    test2 = con.execute("SELECT * FROM customers")
    print(test2.fetchall())
    test3 = con.execute("SELECT * FROM orders")
    print(test3.fetchall())
    print()
    join_query = """
                 SELECT ord_id, orders.cust_id, customers.name FROM orders
                 JOIN customers ON customers.cust_id = orders.cust_id
                 """
    test4 = pd.read_sql_query(join_query, con)
    # print(test4.fetchall())
    
test4

[('cust_id', 'text')]
[('cust001', 'John', 'NJ'), ('cust002', 'Jane', 'NJ'), ('cust003', 'Doe', 'NY'), ('cust004', 'Ray', 'NJ'), ('cust005', 'Mi', 'NY')]
[('ord001', 'cust005', 'books', 1), ('ord002', 'cust001', 'books', 4), ('ord003', 'cust002', 'magazines', 6), ('ord004', 'cust003', 'books', 5), ('ord005', 'cust005', 'books', 5), ('ord006', 'cust004', 'magazines', 3), ('ord007', 'cust005', 'comic', 2), ('ord008', 'cust001', 'comic', 1), ('ord009', 'cust002', 'books', 5)]

   ord_id  cust_id  name
0  ord001  cust005    Mi
1  ord002  cust001  John
2  ord003  cust002  Jane
3  ord004  cust003   Doe
4  ord005  cust005    Mi
5  ord006  cust004   Ray
6  ord007  cust005    Mi
7  ord008  cust001  John
8  ord009  cust002  Jane